src/PAIP2clojure/Chapter5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Porting PAIP to clojure - Chapter 5: ELIZA - Dialog with a machine </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Porting PAIP to clojure - Chapter 5: ELIZA - Dialog with a machine "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-03T21:38+0200"/>
<meta name="author" content="Maik Schünemann"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Porting PAIP to clojure - Chapter 5: ELIZA - Dialog with a machine </h1>


<hr/>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 PAIP to clojure - Chapter 5: Eliza - Dialog with a machine</a></li>
<li><a href="#sec-2">2 Description and specification of ELIZA</a></li>
<li><a href="#sec-3">3 Segment Pattern Matching</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> PAIP to clojure - Chapter 5: Eliza - Dialog with a machine</h2>
<div class="outline-text-2" id="text-1">

<p>  This chapter contains an implementation of the program called ELIZA which could, given appropriate rules,
  emulate an Rogerian psychoanalyst.
  You can try ELIZA if you are using emacs by hitting M-x doctor and start telling about your problems.
</p>
<p>
  Although ELIZA seems to be very sophisticated being able to emulate humans (in a very restricted area),
  It consists merely of a pattern matching tool and a set of rules, which allows it to transform the
  input to output.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Description and specification of ELIZA</h2>
<div class="outline-text-2" id="text-2">

<p>  This is the ELIZA algorithm:
</p><ol>
<li>Read an input
</li>
<li>Find a pattern that matches the input
</li>
<li>Transform the input into a response
</li>
<li>Print the response
</li>
</ol>

<p>  Norvig follows the route of least resistance and uses lisp's built in capabilities to read lisp code and
  print it. This is a good showcase of how good lisp is for quick prototyping.
  Half of the problems are thus trivial, the hard part comes with 2. and 3.
  We need a representation of an general pattern and input, responses to the pattern and the transformation
  of the input according to the rules for the pattern it matches.
  Here is an example:
</p>


<pre class="src src-quoted">Pattern: (I need a X)
Response: (what would it mean to you if you got a X ?)

Input: (I need a vacation)
Transformation: (what yould it mean to you if you got a vacation ?)
</pre>


<p>
  The pattern matches must match normal atoms with itself, but it has to recognize a variable like X.
  In PAIP, variables are starting with an ?
</p>


<pre class="src src-common">(defun variable-p (x)
<span style="color: #ffa07a;">"Is x a variable (a symbol beginning with `?')?"</span>
(and (symbolp x) (equal (elt (symbol-name x) 0) #\?)))
</pre>

<p>
  In clojure:
</p>


<pre class="src src-clojure">(<span style="color: #b0c4de;">ns</span> PAIP2clojure.<span style="color: #b0c4de;">Chapter5</span>)

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">variable?</span> [x]
  (<span style="color: #b0c4de;">let</span> [x-str (<span style="color: #eedd82;">str</span> x)]
    (<span style="color: #b0c4de;">and</span> (<span style="color: #b0c4de;">.startsWith</span> x-str <span style="color: #ffa07a;">"?"</span>) (<span style="color: #eedd82;">&gt;</span> (<span style="color: #b0c4de;">.length</span> x-str) 1))))
</pre>


<p>
  ==&gt; #'PAIP2clojure.Chapter5/variable?
===&gt; #'user/variable?
=  I made a few changes to be able to use clojure's abstractions.
  This version works not only with symbols, like the common lisp version requires, it works with
  everything which can be converted to a string with the str method. So it doesn't matter if you are
  testing symbols read with the read function, or if you are testing a string.
</p>
<p>
  To test whether an input matches the pattern, the pat-match function can just check all elements of the
  input wheter they are variables. If they are, then it matches anything, if not, if fails if the input is not
  the same as the pattern.
</p>
<p>
  But how can the symbols be substituted when a match was succesful. It is great to have the functions pre- and
  postwalk-replace in the namespace clojure.walk, which substitutes elements in a tree given a substitution map.
  (Norvig uses the common lisp equivalent sublis for this purpose wihch takes an associative list instead of
  a real map).
</p>
<p>
  The pat-match function will return an associative list, or a map in clojure, if it succeeded, if it failed,
  it returns nil. This is a problem in common lisp because the empty list is nil in common lisp .
  So there has to be a constant no-bindings which is '((t . t)). In clojure however that is not neccescary.
</p>
<p>
  Also, the three helper functions get-binding binding-val and lookup aren't neccescary because clojure maps
  are very convenient to use.
  This means the clojure version can drop the following lines from the implementation:
</p>


<pre class="src src-common-lisp">(<span style="color: #00ffff;">defconstant</span> <span style="color: #eedd82;">fail</span> nil)
(<span style="color: #00ffff;">defconstant</span> <span style="color: #eedd82;">no-bindings</span> '((t . t)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">get-binding</span> (var bindings)
  (assoc var bindings))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">binding-val</span> (binding)
  (cdr binding))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">lookup</span> (var bindings)
  (binding-val (get-binding var bindings)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">extend-bindings</span> (var val bindings)
  (cons (cons var bal) bindings))
</pre>



<pre class="src src-common-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">pat-match</span> (pattern input <span style="color: #98fb98;">&amp;optional</span> (bindings no-bindings))
<span style="color: #ffa07a;">"Match pattern against input in the context of the bindings"</span>
(<span style="color: #00ffff;">cond</span> ((eq bindings fail) fail)
      ((variable-p pattern)
       (match-variable pattern input bindings))
      ((eql pattern input) bindings)
<span style="color: #ff7f24;">;      </span><span style="color: #ff7f24;">((segment-pattern-p pattern)                ; ***</span>
<span style="color: #ff7f24;">;       </span><span style="color: #ff7f24;">(segment-match pattern input bindings))    ; ***</span>
      ((and (consp pattern) (consp input)) 
       (pat-match (rest pattern) (rest input)
                  (pat-match (first pattern) (first input) 
                             bindings)))
      (t fail)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">match-variable</span> (var input bindings)
  (<span style="color: #00ffff;">let</span> ((binding (get-binding var bindings)))
    (<span style="color: #00ffff;">cond</span> ((not binding) (extend-bindings var input bindings))
          ((equal input (binding-val binding)) bindings)
          (t fail))))


</pre>

<p>
  This time, it is really a straightforward translation from common-lisp to clojure:
</p>


<pre class="src src-clojure">(<span style="color: #eedd82;">use</span> 'auto-declare.core)

(with-auto-declare _
(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">pat-match</span>
  <span style="color: #ffa07a;">"Match pattern against input in the context of the bindings"</span>
  ([pattern input] (pat-match pattern input {}))
  ([pattern input bindings]
     (<span style="color: #b0c4de;">cond</span> (<span style="color: #eedd82;">nil?</span> bindings) nil
           (variable? pattern) (_match-variable pattern input bindings)
           (<span style="color: #eedd82;">=</span> pattern input) bindings
           (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">sequential?</span> pattern) (<span style="color: #eedd82;">sequential?</span> input))
                (pat-match (<span style="color: #eedd82;">rest</span> pattern) (<span style="color: #eedd82;">rest</span> input)
                       (pat-match (<span style="color: #eedd82;">first</span> pattern) (<span style="color: #eedd82;">first</span> input) bindings))
           <span style="color: #7fffd4;">:else</span> nil)))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">match-variable</span>
  <span style="color: #ffa07a;">"Does var match input?"</span>
  [var input bindings]
  (<span style="color: #b0c4de;">let</span> [binding (<span style="color: #eedd82;">get</span> bindings var)]
    (<span style="color: #b0c4de;">cond</span> (<span style="color: #eedd82;">not</span> binding) (<span style="color: #eedd82;">assoc</span> bindings var input)
          (<span style="color: #eedd82;">=</span> input binding) bindings
          <span style="color: #7fffd4;">:else</span> nil)))
)
</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter5/match-variable
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Segment Pattern Matching</h2>
<div class="outline-text-2" id="text-3">

<p>  For ELIZA, matching single elements is not enough. It must be able to match a sequence of items in the input.
  These variables are called segment-variables and are represented by '(?* variable).
  Segment patterns make the following possible:
</p>



<pre class="example">(pat-match '((?* ?p) need (?* ?x))
           '(Mr Hulot and I need a vacation))
((?P MR HULOT AND I) (?X A VACATION))
</pre>


<p>
  First, we have to recognize and handle segment patterns in pat-match. This requires adding a new line:
</p>


<pre class="src src-clojure">(with-auto-declare _
  (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">pat-match</span>
   <span style="color: #ffa07a;">"Match pattern against input in the context of the bindings"</span>
   ([pattern input] (pat-match pattern input {}))
   ([pattern input bindings]
      (<span style="color: #b0c4de;">cond</span> (<span style="color: #eedd82;">nil?</span> bindings) nil
            (variable? pattern) (match-variable pattern input bindings)
            (<span style="color: #eedd82;">=</span> pattern input) bindings
            (_segment-pattern? pattern) (_segment-match pattern input bindings)
            (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">sequential?</span> pattern) (<span style="color: #eedd82;">sequential?</span> input))
                 (pat-match (<span style="color: #eedd82;">rest</span> pattern) (<span style="color: #eedd82;">rest</span> input)
                        (pat-match (<span style="color: #eedd82;">first</span> pattern) (<span style="color: #eedd82;">first</span> input) bindings))
            <span style="color: #7fffd4;">:else</span> nil)))

  (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">segment-pattern?</span> [pattern]
    (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">sequential?</span> pattern) (<span style="color: #b0c4de;">.startsWith</span> (<span style="color: #eedd82;">str</span> (<span style="color: #eedd82;">first</span> pattern)) <span style="color: #ffa07a;">"?*"</span>))))

</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter5/segment-pattern?
</pre>

<p>  segment-match is more complicated than pat-match: How do wee know how much of the input it matches ?
  One approach is to look where the matching input for the pattern after the segment pattern is and to
  match everything up to this position. If this fails, then it is still possible that the segment-pattern
  matches a longer subsequence, so we try again considering only longer matches.
  This works, but rules out the possibility of a variable-pattern direct
  after a segment pattern. This limitaion will be removed later.
</p>


<pre class="src src-common-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">segment-match</span> (pattern input bindings <span style="color: #98fb98;">&amp;optional</span> (start 0))
<span style="color: #ffa07a;">"Match the segment pattern ((?* var) . pat) against input."</span>
(<span style="color: #00ffff;">let</span> ((var (second (first pattern)))
      (pat (rest pattern)))
  (<span style="color: #00ffff;">if</span> (null pat)
      (match-variable var input bindings)
      <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">We assume that pat starts with a constant</span>
      <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">In other words, a pattern can't have 2 consecutive vars</span>
      (<span style="color: #00ffff;">let</span> ((pos (position (first pat) input
                           <span style="color: #b0c4de;">:start</span> start <span style="color: #b0c4de;">:test</span> #'equal)))
        (<span style="color: #00ffff;">if</span> (null pos)
            fail
            (<span style="color: #00ffff;">let</span> ((b2 (pat-match pat (subseq input pos) bindings)))
              <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">If this match failed, try another longer one</span>
              <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">If it worked, check that the variables match</span>
              (<span style="color: #00ffff;">if</span> (eq b2 fail)
                  (segment-match pattern input bindings (+ pos 1))
                  (match-variable var (subseq input 0 pos) b2))))))))
</pre>


<pre class="src src-clojure">    (with-auto-declare _
      (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">segment-match</span>
        <span style="color: #ffa07a;">"Match the segment pattern ((?* var) pat) against input."</span>
        ([pattern input bindings] (segment-match pattern input bindings 0))
        ([pattern input bindings start]
           (<span style="color: #b0c4de;">let</span> [var (<span style="color: #b0c4de;">-&gt;</span> pattern first second)
                 pat (<span style="color: #eedd82;">rest</span> pattern)]
             (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">empty?</span> pat)
               (match-variable var input bindings)
<span style="color: #ff7f24;">;</span><span style="color: #ff7f24;">TODO implement this right need position and subsequence</span>
               )))))
</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter5/segment-match
</pre>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-03T21:38+0200</p>
<p class="author">Author: Maik Schünemann</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
